{
  "name": "audience_quarter_clusters",
  "description": "Identifies and analyzes high-performing target audience clusters for the current quarter (last 3 months of available data).\nThis model groups campaigns by Company, Target_Audience, Location, Channel, and Goal to form clusters.\nIt calculates key performance indicators (KPIs) like average ROI, conversion rate, CTR, and acquisition cost for each cluster.\nClusters are then scored using normalized z-scores against company averages, ranked within their company and audience segment, and assigned performance tiers with recommended actions.\nThe goal is to highlight the most effective combinations of targeting dimensions for strategic decision-making and budget allocation.\nThis model powers the 'High-ROI Target Audience Clusters' visualization in the Cohort Analysis dashboard tab.\n",
  "columns": [
    {
      "name": "Company",
      "type": "VARCHAR",
      "description": "The name of the company associated with the campaign cluster. This serves as the primary dimension for analysis.",
      "tests": [
        "not_null",
        "dbt_utils.unique_combination_of_columns",
        "relationships"
      ],
      "tags": []
    },
    {
      "name": "Target_Audience",
      "type": "VARCHAR",
      "description": "The specific audience segment targeted by the campaigns within the cluster. This serves as the secondary dimension.",
      "tests": [
        "not_null",
        "relationships"
      ],
      "tags": []
    },
    {
      "name": "Location",
      "type": "VARCHAR",
      "description": "The geographical location associated with the campaigns in the cluster.",
      "tests": [
        "not_null",
        "relationships"
      ],
      "tags": []
    },
    {
      "name": "channel",
      "type": "VARCHAR",
      "description": "The marketing channel used for the campaigns in the cluster (e.g., Facebook, Twitter, Instagram). Renamed from source column 'Channel_Used'.",
      "tests": [
        "not_null",
        "relationships"
      ],
      "tags": []
    },
    {
      "name": "goal",
      "type": "VARCHAR",
      "description": "The primary objective of the campaigns within the cluster (e.g., Increase Sales, Brand Awareness). Renamed from source column 'Campaign_Goal'.",
      "tests": [
        "not_null",
        "relationships"
      ],
      "tags": []
    },
    {
      "name": "campaign_count",
      "type": "BIGINT",
      "description": "The number of individual campaigns included in this specific cluster combination for the quarter. Clusters with less than 3 campaigns are excluded for statistical significance.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "avg_conversion_rate",
      "type": "DOUBLE",
      "description": "The average conversion rate (conversions / clicks or impressions, depending on definition) across all campaigns within the cluster for the quarter.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_between"
      ],
      "tags": []
    },
    {
      "name": "avg_roi",
      "type": "DOUBLE",
      "description": "The average Return on Investment (ROI) across all campaigns within the cluster for the quarter. Calculated as (Revenue - Spend) / Spend.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "avg_acquisition_cost",
      "type": "DOUBLE",
      "description": "The average cost to acquire a customer or achieve a conversion goal (Spend / Conversions) across campaigns in the cluster for the quarter.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "avg_ctr",
      "type": "FLOAT",
      "description": "The average Click-Through Rate (Clicks / Impressions) across campaigns in the cluster for the quarter. Calculated as SUM(Clicks) / SUM(Impressions).",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_between"
      ],
      "tags": []
    },
    {
      "name": "total_spend",
      "type": "DOUBLE",
      "description": "The total calculated advertising spend for all campaigns within the cluster for the quarter. Calculated as SUM(Clicks * Acquisition_Cost) based on available data.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "total_revenue",
      "type": "DOUBLE",
      "description": "The total calculated revenue generated by all campaigns within the cluster for the quarter. Calculated as SUM(Clicks * Acquisition_Cost * ROI) based on available data.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "avg_audience_conversion_rate",
      "type": "DOUBLE",
      "description": "The average conversion rate for all clusters belonging to the same Company and Target Audience combination within the quarter. Used for comparison within the audience segment.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_between"
      ],
      "tags": []
    },
    {
      "name": "avg_audience_roi",
      "type": "DOUBLE",
      "description": "The average ROI for all clusters belonging to the same Company and Target Audience combination within the quarter. Used for comparison within the audience segment.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "avg_audience_ctr",
      "type": "DOUBLE",
      "description": "The average CTR for all clusters belonging to the same Company and Target Audience combination within the quarter. Used for comparison within the audience segment.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_between"
      ],
      "tags": []
    },
    {
      "name": "avg_audience_acquisition_cost",
      "type": "DOUBLE",
      "description": "The average acquisition cost for all clusters belonging to the same Company and Target Audience combination within the quarter. Used for comparison within the audience segment.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "cluster_count",
      "type": "BIGINT",
      "description": "The total number of distinct clusters (Company, Target_Audience, Location, Channel, Goal combinations) found for this specific Company and Target Audience pair within the quarter.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "conversion_rate_z_score",
      "type": "DOUBLE",
      "description": "The normalized z-score for the cluster's average conversion rate compared to the company's average and standard deviation for the quarter. Indicates performance relative to the company average (higher is better).",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "roi_z_score",
      "type": "DOUBLE",
      "description": "The normalized z-score for the cluster's average ROI compared to the company's average and standard deviation for the quarter. Indicates performance relative to the company average (higher is better).",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "ctr_z_score",
      "type": "DOUBLE",
      "description": "The normalized z-score for the cluster's average CTR compared to the company's average and standard deviation for the quarter. Indicates performance relative to the company average (higher is better).",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "cost_efficiency_z_score",
      "type": "DOUBLE",
      "description": "The normalized z-score for the cluster's cost efficiency (lower acquisition cost is better), compared to the company average and standard deviation for the quarter. Calculated with an inverse relationship so higher scores indicate better cost efficiency.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "composite_performance_score",
      "type": "DOUBLE",
      "description": "A weighted score combining the z-scores of conversion rate (35%), ROI (35%), CTR (15%), and cost efficiency (15%) to provide an overall performance measure for the cluster relative to the company average.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "roi_rank",
      "type": "BIGINT",
      "description": "The rank of this cluster within its Company based on average ROI (descending) for the quarter. Rank 1 indicates the highest ROI within the company.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "conversion_rate_rank",
      "type": "BIGINT",
      "description": "The rank of this cluster within its Company based on average conversion rate (descending) for the quarter. Rank 1 indicates the highest conversion rate within the company.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "acquisition_cost_rank",
      "type": "BIGINT",
      "description": "The rank of this cluster within its Company based on average acquisition cost (ascending) for the quarter. Rank 1 indicates the lowest acquisition cost (most efficient) within the company.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "audience_roi_rank",
      "type": "BIGINT",
      "description": "The rank of this cluster within its Company and Target Audience group based on average ROI (descending) for the quarter. Rank 1 indicates the highest ROI within that specific audience segment.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "audience_conversion_rate_rank",
      "type": "BIGINT",
      "description": "The rank of this cluster within its Company and Target Audience group based on average conversion rate (descending) for the quarter. Rank 1 indicates the highest conversion rate within that specific audience segment.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_great_or_equal_to"
      ],
      "tags": []
    },
    {
      "name": "roi_percentile",
      "type": "FLOAT",
      "description": "The percentile rank of the cluster's ROI within its Company for the quarter (calculated based on roi_rank / total_clusters). Values range from ~0 to 1, where lower values indicate better relative ROI performance compared to other clusters in the same company.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_between"
      ],
      "tags": []
    },
    {
      "name": "is_high_performing_cluster",
      "type": "BOOLEAN",
      "description": "A boolean flag indicating if the cluster ranks in the top 10% based on the composite performance score within its Company for the quarter (TRUE if top 10%, FALSE otherwise).",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "performance_tier",
      "type": "VARCHAR",
      "description": "A categorical tier assigned based on the composite performance score ('Exceptional', 'High Performing', 'Average', 'Underperforming', 'Poor'). Provides a quick assessment of the cluster's overall relative performance.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "recommended_action",
      "type": "VARCHAR",
      "description": "A suggested action based on the performance tier (e.g., 'Increase investment', 'Monitor and optimize', 'Consider discontinuing'). Aims to guide strategic decisions regarding resource allocation for this cluster.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    }
  ],
  "tags": []
}