{
  "name": "audience_metrics",
  "description": "Aggregates key campaign performance metrics from stg_campaigns, grouping by target audience. This model provides insights into how different audience segments perform across various metrics like conversion rate, ROI, cost, clicks, and impressions.",
  "columns": [
    {
      "name": "Target_Audience",
      "type": "VARCHAR",
      "description": "The specific demographic or behavioral segment targeted by the campaigns. This acts as the primary dimension for aggregation in this model.",
      "tests": [
        "unique",
        "not_null",
        "relationships"
      ],
      "tags": []
    },
    {
      "name": "campaign_count",
      "type": "BIGINT",
      "description": "The total number of distinct campaigns associated with this target audience.",
      "tests": [
        "not_null",
        "dbt_utils.accepted_range"
      ],
      "tags": []
    },
    {
      "name": "avg_conversion_rate",
      "type": "DOUBLE",
      "description": "The average conversion rate across all campaigns targeting this audience. Typically calculated as (Total Conversions / Total Clicks or Impressions) averaged per campaign, depending on the specific definition in the source.",
      "tests": [
        "not_null",
        "dbt_utils.accepted_range"
      ],
      "tags": []
    },
    {
      "name": "avg_roi",
      "type": "DOUBLE",
      "description": "The average Return on Investment (ROI) across all campaigns targeting this audience. Typically calculated as ((Revenue - Cost) / Cost) averaged per campaign.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "avg_acquisition_cost",
      "type": "DOUBLE",
      "description": "The average cost to acquire a customer (CAC) or achieve a conversion goal across all campaigns targeting this audience.",
      "tests": [
        "not_null",
        "dbt_utils.accepted_range"
      ],
      "tags": []
    },
    {
      "name": "total_clicks",
      "type": "HUGEINT",
      "description": "The total number of clicks accumulated across all campaigns targeting this audience.",
      "tests": [
        "not_null",
        "dbt_utils.accepted_range"
      ],
      "tags": []
    },
    {
      "name": "total_impressions",
      "type": "HUGEINT",
      "description": "The total number of impressions served across all campaigns targeting this audience.",
      "tests": [
        "not_null",
        "dbt_utils.accepted_range"
      ],
      "tags": []
    },
    {
      "name": "overall_ctr",
      "type": "FLOAT",
      "description": "The overall Click-Through Rate (CTR) for this target audience, calculated as (Total Clicks / Total Impressions) across all associated campaigns for the segment.",
      "tests": [
        "not_null",
        "dbt_utils.accepted_range"
      ],
      "tags": []
    }
  ],
  "tags": []
}