{
  "name": "trend_change",
  "description": "This mart model analyzes monthly campaign performance trends for each company. It calculates key metrics (Conversion Rate, ROI, Acquisition Cost, CTR) on a monthly basis, computes 3-month moving averages to smooth out fluctuations, and then identifies significant changes in the direction of these trends by comparing current moving averages to those from three months prior. This helps in understanding shifts in marketing effectiveness over time.\n",
  "columns": [
    {
      "name": "Company",
      "type": "VARCHAR",
      "description": "The name of the company being analyzed.",
      "tests": [
        "not_null",
        "dbt_utils.unique_combination_of_columns"
      ],
      "tags": []
    },
    {
      "name": "month",
      "type": "BIGINT",
      "description": "The calendar month number (4-12) for which the metrics are calculated. Months 1-3 are excluded due to the 3-month moving average and lag calculation requirements.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "avg_conversion_rate",
      "type": "DOUBLE",
      "description": "The average conversion rate for the company during the specified month.",
      "tests": [
        "not_null",
        "dbt_expectations.expect_column_values_to_be_between"
      ],
      "tags": []
    },
    {
      "name": "conversion_rate_ma",
      "type": "DOUBLE",
      "description": "The 3-month moving average of the conversion rate, including the current month and the two preceding months.",
      "tests": [
        "not_null"
      ],
      "tags": []
    },
    {
      "name": "prev_conversion_rate_ma",
      "type": "DOUBLE",
      "description": "The 3-month moving average of the conversion rate from three months prior to the current month. Used as a baseline for trend change detection.",
      "tests": [],
      "tags": []
    },
    {
      "name": "conversion_rate_trend_change",
      "type": "INTEGER",
      "description": "Indicator of a change in the conversion rate trend. 1 indicates an upward trend change (current MA > previous MA and prior month's MA was <= previous MA), -1 indicates a downward trend change (current MA < previous MA and prior month's MA was >= previous MA), 0 indicates no significant change in trend direction.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "roi_trend_change",
      "type": "INTEGER",
      "description": "Indicator of a change in the Return on Investment (ROI) trend. 1 indicates an upward trend change, -1 indicates a downward trend change, 0 indicates no significant change.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "acquisition_cost_trend_change",
      "type": "INTEGER",
      "description": "Indicator of a change in the Acquisition Cost trend. Note: Lower cost is better. 1 indicates a downward (positive) trend change in cost, -1 indicates an upward (negative) trend change in cost, 0 indicates no significant change.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "ctr_trend_change",
      "type": "INTEGER",
      "description": "Indicator of a change in the Click-Through Rate (CTR) trend. 1 indicates an upward trend change, -1 indicates a downward trend change, 0 indicates no significant change.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    },
    {
      "name": "has_trend_change",
      "type": "BOOLEAN",
      "description": "A boolean flag indicating whether any of the monitored metrics (Conversion Rate, ROI, Acquisition Cost, CTR) experienced a trend change in the specified month for the company.",
      "tests": [
        "not_null",
        "accepted_values"
      ],
      "tags": []
    }
  ],
  "tags": []
}